IDENTIFICATION DIVISON.
PROGRAM-ID. SUM.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01 WORKING-AREA.
  03 COUNT PIC 9(2).
  03 SUM   PIC 9(3).
  03 DSP_BUF PIC X(64).

PROCEDURE DIVISION
MAIN-PROCEDURE.

MOVE 1 TO COUNT.
MOVE 0 TO SUM.

PERFORM IF COUNT <= 10
  COMPUTE SUM   = SUM + COUNT
  COMPUTE COUNT = COUNT + 1
  END-PERFORM.

STRING "1から10までの合計は SUM です。"
DELIMITED BY SPACE
INTO DSP_BUF.
DISPLAY DSP_BUF.

STOP RUN.

END PROGRAM SUM.


